# CannotDrawExtrusionsError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ExtrusionFailures..::..CannotDrawExtrusionsError Property
BuiltInFailures..::..ExtrusionFailures Class See Also
---
Can't make Extrusion.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDrawExtrusionsError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDrawExtrusionsError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDrawExtrusionsError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ExtrusionFailures Class
Autodesk.Revit.DB Namespace